/*
 * QsLib <QN Layer>
 * Made by kim 2004-2024
 *
 * 이 라이브러리는 연구용입니다. 사용 여부는 사용자 본인의 의사에 달려 있습니다.
 * 라이브러리의 일부 또는 전부를 사용자 임의로 전제하거나 사용할 수 있습니다.
 */
/**
 * @file qs_qn.h
 *
 * <QN Layer>는 CRT의 부족한 부분을 보충합니다.
 */
#pragma once

#ifdef _MSC_VER
#pragma warning(push)
#pragma warning(disable:4201)	// L4, nonstandard extension used : nameless struct/union
#endif


//////////////////////////////////////////////////////////////////////////
// includes
#include <stdint.h>
#include <stdbool.h>
#include <stdarg.h>
#include <stdlib.h>
#include <stdio.h>
#include <string.h>
#include <time.h>
#include <signal.h>
#include <wchar.h>
#ifdef __unix__
#include <sys/time.h>
#endif

//////////////////////////////////////////////////////////////////////////
// compiler configuration

// check
#if !defined _MSC_VER && !defined __GNUC__
#error unknown compiler! (support: MSVC, CLANG, GCC)
#endif

// platform
#ifdef _WIN32
#define _QN_WINDOWS_		1
#endif

#if defined __FreeBSD__ || defined __OpenBSD__
#define _QN_BSD_			1
#endif

#ifdef __linux__
#define _QN_LINUX_			1
#endif

#ifdef __android__
#define _QN_ANDROID_		1
#define _QN_MOBILE_			1
#endif

#ifdef __unix__
#define _QN_UNIX_			1
#endif

#if defined _WIN64 || defined __LP64__ || defined __amd64__ || defined __x86_64__ || defined __aarch64__
#define _QN_64_				1
#endif

#ifdef _CHAR_UNSIGNED
#error "Compiler option: char type must be signed"
#endif

// compiler specific
#ifdef _MSC_VER

#define _QN_CONCAT_2(x,y)	x##y
#define _QN_CONCAT_3(x,y,z)	x##y##z

// function
#define QN_STRING(x)		_QN_STRING(x)					/** @brief 문자열로 정의 */
#define QN_UNICODE(x)		_QN_UNICODE(x)					/** @brief 유니코드로 정의 */
#define QN_CONCAT_2(x,y)	_QN_CONCAT_2(x, y)				/** @brief 두개 문구 합침 */
#define QN_CONCAT_3(x,y,z)	_QN_CONCAT_3(x, y, z)			/** @brief 세개 문구 합침 */
#define QN_CONCAT(...)		_QN_GET_MAC_3(__VA_ARGS__, QN_CONCAT_3, QN_CONCAT_2)(__VA_ARGS__)		/** @brief 문구 합침 (세개까지) */

#define QN_COUNTOF(arr)		(sizeof(arr)/sizeof((arr)[0]))	/** @brief 배열 갯수 얻기 */
#define QN_OFFSETOF(t,m)	((size_t)((char*)&((t*)0)->m))	/** @brief 구조체에서 위치 얻기 */
#define QN_MEMBEROF(t,p,o)	(*(t*)((void*)((char*)(p)+(size_t)(o))))								/** @brief 구조체에서 위치 얻기(포인터) */

#define QN_MAX(a,b)			(((a)>(b))?(a):(b))				/** @brief 최대값 얻기 */
#define QN_MIN(a,b)			(((a)<(b))?(a):(b))				/** @brief 최소값 얻기 */
#define QN_ABS(v)			(((v)<0)?-(v):(v))				/** @brief 절대값 얻기 */
#define QN_CLAMP(v,l,h)		((v)<(l)?(l):(v)>(h)?(h):(v))	/** @brief 숫자를 최소/최대값으로 자르기 */

#define QN_BIT(b)			(1<<(b))						/** @brief 비트 만들기 */
#define QN_TBIT(v,bit)		(((v)&(1<<(bit)))!=0)			/** @brief 비트가 있나 비교 */
#define QN_TMASK(v,m)		(((v)&(m))!=0)					/** @brief 마스크가 있나 비교 */
#define QN_SBIT(pv,b,set)	((set)?((*(pv))|=(1<<(b))):((*(pv))&=~(1<<(b))))						/** @brief 비트 설정 */
#define QN_SMASK(pv,m,set)	((set)?((*(pv))|=(m)):((*(pv))&=~(m)))									/** @brief 마스크 설정 */

// constant
#define QN_USEC_PER_SEC		1000000							/** @brief 초당 마이크로초  */
#define QN_NSEC_PER_SEC		1000000000						/** @brief 초당 나노초  */

#define QN_MIN_HASH			11								/** @brief 최소 해시 갯수 */
#define QN_MAX_HASH			13845163						/** @brief 최대 해시 갯수 */
#define QN_MAX_RAND			0x7FFF							/** @brief 최대 난수 */
#define QN_MAX_PATH			1024							/** @brief 경로의 최대 길이 */

// path separator
#ifdef _QN_WINDOWS_
#define QN_PATH_SEP			'\\'							/** @brief 경로 분리 문자 */
#else
#define QN_PATH_SEP			'/'
#endif


//////////////////////////////////////////////////////////////////////////
// types

#ifndef BOOL
#define BOOL				int
#endif

typedef void (*func_t)(void);								/** @brief 함수 핸들러 */
typedef void (*paramfunc_t)(void*);							/** @brief 파라미터 있는 함수 핸들러 */

// aliases
typedef int8_t				sbyte;							/** @brief 8비트 부호 있는 정수 */
typedef int64_t				llong;							/** @brief 64비트 부호 있는 정수 */
typedef uint8_t				byte;							/** @brief 8비트 부호 없는 정수 */
typedef uint16_t			ushort;							/** @brief 16비트 부호 없는 정수 */
typedef uint32_t			uint;							/** @brief 32비트 부호 없는 정수 */
typedef uint64_t			ullong;							/** @brief 64비트 부호 없는 정수 */

typedef intptr_t			nint;							/** @brief 플랫폼에 따른 부호 있는 포인터 */
typedef uintptr_t			nuint;							/** @brief 플랫폼에 따른 부호 없는 포인터 */

typedef wchar_t				wchar;
#ifdef _QN_WINDOWS_
typedef uint32_t			uchar4;							/** @brief 4바이트(32비트) 유니코드 */
typedef wchar_t				uchar2;							/** @brief 2바이트(16비트) 유니코드 */
#else
typedef wchar_t				uchar4;
typedef uint16_t			uchar2;
#endif

typedef uint16_t			halfint;						/** @brief 16bit half int */

/** @brief 하위 변형 있는 16비트 정수 */
typedef union vint16_t
{
	struct
	{
		byte			l, h;
	}				b;
	ushort			w;
} vint16_t, vshort;

/** @brief 하위 변형 있는 32비트 정수 */
typedef union vint32_t
{
	struct
	{
		byte			a, b, c, d; // d=msb
	}				b;
	struct
	{
		ushort			l, h;
	}				w;
	uint			dw;
} vint32_t, vint;

/** @brief 하위 변형 있는 64비트 정수 */
typedef union vint64_t
{
	struct
	{
		byte			la, lb, lc, ld;
		byte			ha, hb, hc, hd; // hd=msb
	}				b;
	struct
	{
		ushort			a, b, c, d;
	}				w;
	struct
	{
		ushort			l, h;
	} dw;
	ullong			q;
} vint64_t, vllong;

/** @brief 아무값이나 넣기 위한 타입 */
typedef union any_t
{
	bool			b;
	int				i;
	uint			u;
	float			f;

	char*			s;
	wchar*			w;
	void*			p;
	const void*		cp;
	func_t			func;

	llong			ll;
	ullong			ull;
	double			dbl;

	byte			data[8];
} any_t;

/** @brief 파라미터 함수 핸들러와 파라미터 값 */
typedef struct funcparam_t
{
	paramfunc_t		func;
	void*			data;
} funcparam_t;

// conditions
#define qn_ret_if_fail(x)	QN_STMT_BEGIN{ if (!(x)) return; }QN_STMT_END							/** @brief 값이 거짓이면 리턴 */
#define qn_ret_if_ok(x)		QN_STMT_BEGIN{ if ((x)) return; }QN_STMT_END							/** @brief 값이 참이면 리턴 */
#define qn_val_if_fail(x,r)	QN_STMT_BEGIN{ if (!(x)) return (r); }QN_STMT_END						/** @brief 값이 거짓이변 반환 */
#define qn_val_if_ok(x,r)	QN_STMT_BEGIN{ if ((x)) return (r); }QN_STMT_END						/** @brief 값이 참이면 반환 */

#ifdef _DEBUG
#define qn_assert(expr,m)	QN_STMT_BEGIN{if (!(expr)) qn_debug_assert(#expr, m, __FILE__, __LINE__);}QN_STMT_END		/** @brief 표현이 거짓이면 메시지 출력 */
#define qn_verify(expr)		QN_STMT_BEGIN{if (!(expr)) qn_debug_assert(#expr, NULL, __FILE__, __LINE__);}QN_STMT_END	/** @brief 표현이 거짓이면 표현 출력 */
#else
#define qn_assert(expr,m)
#define qn_verify(expr)
#endif
#define QN_ASSERT_SIZE(t,s)	QN_STATIC_ASSERT(sizeof(t) == s, #t " size is not match")

// type check
QN_ASSERT_SIZE(BOOL, 4);
QN_ASSERT_SIZE(byte, 1);
QN_ASSERT_SIZE(ushort, 2);
QN_ASSERT_SIZE(uint, 4);
QN_ASSERT_SIZE(ullong, 8);
QN_ASSERT_SIZE(nuint, sizeof(size_t));
QN_ASSERT_SIZE(halfint, 2);
QN_ASSERT_SIZE(vshort, 2);
QN_ASSERT_SIZE(vint, 4);
QN_ASSERT_SIZE(vllong, 8);
QN_ASSERT_SIZE(any_t, sizeof(long double));
QN_ASSERT_SIZE(funcparam_t, sizeof(size_t) * 2);


//////////////////////////////////////////////////////////////////////////
// runtime

/**
 * @brief 런타임 초기화
 * @param[out] v 버전 값. NULL 가능
*/
QSAPI void qn_runtime(int /*NULLABLE*/v[2]);
/**
 * @brief 프로그램 종료할 때 실행할 함수 등록
 * @param[in] func 실핼할 함수
 * @param[in] data 함수에 전달할 데이터
*/
QSAPI void qn_atexit(paramfunc_t func, void* data);
/**
 * @brief 프로그램 종료할 때 실행할 함수 등록 (우선 순위 높음)
 * @param[in] func 실핼할 함수
 * @param[in] data 함수에 전달할 데이터
*/
QSAPI void qn_atexitp(paramfunc_t func, void* data);
/**
 * @brief size_t형으로 순서 값을 얻는다
 * @return 순서값
 * @retval 1 맨첨에 불렸을 때
*/
QSAPI size_t qn_number(void);

/**
 * @brief 디버그용 문자열 출력
 * @param[in] breakpoint 참이면 디버거 연결시 중단점 표시
 * @param[in] head 머릿글
 * @param[in] mesg 메시지
 * @return 출력한 문자열 길이
*/
QSAPI int qn_debug_outputs(bool breakpoint, const char* head, const char* mesg);
/**
 * @brief 디버그용 문자열 포맷 출력
